Core/src/AccumulationRegisters/ЗапасыНаСкладах/ЗапасыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапасыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/CommonModules/РозницаОтрицательныеОстаткиВызовСервера/Module.bsl
Функция ЕстьОтрицательныеОстатки(СсылкаНаДокумент, Организация, СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗапасыНаСкладахОстатки.Номенклатура,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыНаСкладахОстатки
		|ГДЕ
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток < 0
		|;";
		
	Если НачалоМесяца(СсылкаНаДокумент.Дата) < НачалоМесяца(ТекущаяДатаСеанса()) Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗапасыНаСкладахОстатки.Номенклатура,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			&ГраницаДокументаВключая,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыНаСкладахОстатки
		|ГДЕ
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("ГраницаДокументаВключая", Новый Граница(КонецМесяца(СсылкаНаДокумент.Дата), ВидГраницы.Включая));
		МРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МРезультатов[0].Пустой() И НЕ МРезультатов[1].Пустой() Тогда
			Возврат СтрЗаменить(НСтр("ka='Есть остатки < 0 на %КонецМесяца% и на текущую дату';ru='Есть остатки < 0 на %КонецМесяца% и на текущую дату';en='There are remains of <0% on KonetsMesyatsa% and the current date'"), "%КонецМесяца%", Формат(КонецМесяца(СсылкаНаДокумент.Дата), "ДЛФ=D"));
		ИначеЕсли НЕ МРезультатов[0].Пустой() Тогда
			Возврат НСтр("ka='Есть остатки < 0 на текущую дату';ru='Есть остатки < 0 на текущую дату';en='There are remains of <0 on the current date'");
		ИначеЕсли НЕ МРезультатов[1].Пустой() Тогда
			Возврат СтрЗаменить(НСтр("ka='Есть остатки < 0 на %КонецМесяца%';ru='Есть остатки < 0 на %КонецМесяца%';en='There are remains of <0% on KonetsMesyatsa%'"), "%КонецМесяца%", Формат(КонецМесяца(СсылкаНаДокумент.Дата), "ДЛФ=D"));
		Иначе
			Возврат "";
		КонецЕсли;
	Иначе
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Возврат НСтр("ka='Есть остатки < 0 на текущую дату';ru='Есть остатки < 0 на текущую дату';en='There are remains of <0 on the current date'");
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
